from string import Template
# System Prompt
system_prompt = Template("\n".join( [

            "أنت مساعد مفيد يساعد في إجابة الأسئلة بناءً على السياق المقدم", 
            "سيتم إعطاؤك سؤال وسياق. يجب أن تجيب على السؤال بناءً على السياق المقدم.",
            "إذا لم يكن الجواب في السياق، قل 'لا أعرف.'" ,
            "كن مختصرًا ودقيقًا. لا تقدم أي معلومات إضافية ليست في السياق.",
            " كن لطيفًا ومحترفًا في ردك.",
            "أجب باللغة نفسها التي سألت بها. إذا كان السؤال بالإنجليزية، أجب بالإنجليزية. إذا كان السؤال بلغة أخرى, أجب بلغة أخرى.",

                 ]))

#user_prompt 
user_prompt = Template(
    "\n".join([
        "رقم_المستند: $document_number",
        "السياق: $context",

    ]
))

#foter_prompt
foter_prompt = Template(
    "\n".join([
        "بناءً على السياق المقدم, أجب على السؤال.",
        "## الإجابات",]
    )
)
